integration/src/InformationRegisters/грОтложеннноеПроведение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>грОтложеннноеПроведение</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПакета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

integration/src/InformationRegisters/грОтложеннноеПроведение/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания Экспорт;

&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания() Экспорт
	
	грОтложенныеОперацииИнтеграцииКлиент.Подключаемый_ПроверитьВыполнениеЗадания(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СнятьОшибкуНаСервере()
	
	Для Каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		
		МенеджерЗаписи = РегистрыСведений.грОтложеннноеПроведение.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Документ = СтрокаСписка.Документ;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.ОписаниеОшибки = "";
		МенеджерЗаписи.Ошибка = Ложь;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокументы(Команда)
	
	грОтложенныеОперацииИнтеграцииКлиент.ЗапуститьФоновоеЗаданиеОбработатьИсточникиДанных(
		ЭтотОбъект,
		Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОшибку(Команда)
	
	СнятьОшибкуНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
